app/controllers/collaborations_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @current_user = User.find(session[:user_id])

SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @collaboration = Collaboration.find(params[:id])
    @current_user = User.find(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def new
    @collaboration = Collaboration.new
    @current_user = User.find(session[:user_id])

SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def edit
    @collaboration = Collaboration.find(params[:id])
    @current_user = User.find(session[:user_id])

INSERT INTO "collaborations" ("created_at", "updated_at", "subject", "created_by", "description", "status") VALUES('2010-08-07 10:40:20', '2010-08-07 10:40:20', 'My First Collaboration', 1, 'First!', 'In-Progress')
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def create
    @collaboration = Collaboration.new(params[:collaboration])
    @collaboration.created_by = session[:user_id]
    @current_user = User.find(session[:user_id])

SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "collaborations" SET "updated_at" = '2010-08-16 14:24:54', "status" = 'Open' WHERE "id" = 1
---
  def update
    @collaboration = Collaboration.find(params[:id])
    @current_user = User.find(session[:user_id])

    respond_to do |format|
      if @collaboration.update_attributes(params[:collaboration])