app/controllers/collaborations_controller.rb

  def index
    @collaborations = Collaboration.all
---
SELECT * FROM "collaborations"