app/controllers/collaboration_users_controller.rb

SELECT * FROM "collaboration_users" WHERE ("collaboration_users"."collaboration_id" IS NULL)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def index
    @collaboration_users = CollaborationUser.find_all_by_collaboration_id(params[:collaboration_id])
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "collaboration_users" WHERE ("collaboration_users"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def show
    @collaboration_user = CollaborationUser.find(params[:id])
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def new
    @collaboration_user = CollaborationUser.new
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "collaboration_users" WHERE ("collaboration_users"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def edit
    @collaboration_user = CollaborationUser.find(params[:id])
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
SELECT * FROM "users" WHERE ("users"."email" IS NULL) LIMIT 1
INSERT INTO "collaboration_users" ("created_at", "updated_at", "manager", "user_id", "collaboration_id") VALUES('2010-08-08 11:33:57', '2010-08-08 11:33:57', 't', 1, 1)
---
  def create
    @collaboration_user = CollaborationUser.new(params[:collaboration_user])
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

    # TODO: could enforce this in the model
    @collaboration_user.collaboration_id = @collaboration.id

    # see if there is an existing user to add
    # TODO: Otherwise ask the user to confirm whether to invite them to join
    # TODO: use transactions here
    logger.debug "Searching for " + @collaboration_user.email

    user_to_add = User.find_by_email(@collaboration_user.email)
    if user_to_add.nil? then
      logger.debug "NO matching user found for " + @collaboration_user.email
      logger.debug "Creating a new one... "
      user_to_add = User.new( :email => @collaboration_user.email,
        :full_name => @collaboration_user.email[/^[^@]*/] )
      user_to_add.password = "foobar"
      user_to_add.save

SELECT * FROM "collaboration_users" WHERE ("collaboration_users"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 2)
UPDATE "collaboration_users" SET "updated_at" = '2010-08-16 17:39:55', "manager" = 't' WHERE "id" = 9
---
  def update
    @collaboration_user = CollaborationUser.find(params[:id])
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

    respond_to do |format|
      if @collaboration_user.update_attributes(params[:collaboration_user])

SELECT * FROM "collaboration_users" WHERE ("collaboration_users"."id" = 3)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "collaboration_users" WHERE "id" = 3
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def destroy
    @collaboration_user = CollaborationUser.find(params[:id])
    @collaboration_user.destroy
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])