app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
UPDATE "tasks" SET "updated_at" = '2010-08-06 12:37:52', "status" = 'Closed', "resolution" = 'Unresolved' WHERE "id" = 1
---
  def set_task_title
      @task = Task.find(params[:id])
      @task.update_attributes(:title => params[:value])

SELECT * FROM "tasks"
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def index
    @tasks = Task.all
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def show
    @task = Task.find(params[:id])
    @topic = @task.topic;
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def new
    @task = Task.new
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
---
  def edit
    @current_user = User.find(session[:user_id])
    @task = Task.find(params[:id])
    @topic = @task.topic;
    @collaboration = Collaboration.find(params[:collaboration_id])

INSERT INTO "tasks" ("created_at", "resolution", "assigned_to", "title", "updated_at", "created_by", "type", "description", "status") VALUES('2010-08-07 09:01:03', 'Unresolved', NULL, 'Task with Created_By', '2010-08-07 09:01:03', 1, 'Task', 'test', 'New')
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def create
    @task = Task.new(params[:task])
    @task.created_by = session[:user_id]
    @task.updated_by = session[:user_id]
    @current_user = User.find(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def update
    @task = Task.find(params[:id])
    @current_user = User.find(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "collaborations" WHERE ("collaborations"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 3
---
  def destroy
    @task = Task.find(params[:id])
    @current_user = User.find(session[:user_id])
    @collaboration = Collaboration.find(params[:collaboration_id])
    @task.destroy