app/controllers/users_controller.rb

SELECT * FROM "users"
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.all
    @current_user = User.find(session[:user_id])

INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "full_name", "email") VALUES('369678960.119266464752328', '2010-08-06 18:31:44', '2010-08-06 18:31:44', 'f394e62a1823ab03f1dadad12e77a1a92051685b', 'Mark Cowlishaw 3', 'mark.cowlishaw3@gmail.com')
---
  def create
    @user = User.new(params[:user])
    @current_user = User.find(session[:user_id])
    @collaborations = @current_user.collaborations

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2010-08-07 06:49:56', "salt" = '371820120.0117026772997286', "hashed_password" = 'a3aac8dc5f1dc2cae1f01554ed5030c6f5445239' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    @current_user = User.find(session[:user_id])

    @user.skip_password_check = true

    respond_to do |format|
      if @user.update_attributes(params[:user])